class Test:
    def __init__(self):
        pass
    
for i in range(10):
    pass

if 1 == 1 :# 1
    if 2 == 2:# 1
        ...# 1
        # 1

print([x for x in range(10)])

SZYF_STARTYEAR = 2006
SEX_TYPE: tuple[str] = ("男", "女")
WORK_STATUS: tuple[str] = ("当前在岗", "服务期满", "岗位脱离", "未上岗", "拟招募")
SERVICE_TYPES: tuple[str] = (
    "支农",
    "支教",
    "支医",
    "扶贫",
    "帮扶乡村振兴",
    "林草",
    "水利",
    "其他",
    "就业和社会保障服务平台",
)
EDUCATION_TYPES: tuple[str] = ("本科", "专科", "硕士研究生")
POLITICS_STATUS: tuple[str] = ("党员", "民主党派", "群众", "团员")
XJ_HOUSEHOLD_REGISTER: tuple[str] = ("新疆", "阿克苏")
SOUTH_FIVE_AREAS: dict[str, tuple[str]] = {
    "阿克苏": (
        "阿克苏市",
        "库车县",
        "沙雅县",
        "新和县",
        "拜城县",
        "温宿县",
        "阿瓦提县",
        "乌什县",
        "柯坪县",
    ),
    "和田": (
        "皮山县",
        "墨玉县",
        "和田市",
        "和田县",
        "洛浦县",
        "策勒县",
        "于田县",
        "民丰县",
        "和安县",
        "和康县",
    ),
    "喀什": (
        "泽普县",
        "岳普湖县",
        "伽师县",
        "叶城县",
        "喀什市",
        "疏勒县",
        "麦盖提县",
        "疏附县",
        "巴楚县",
        "英吉沙县",
        "莎车县",
        "塔什库尔干塔吉克自治县",
    ),
    "克孜勒苏柯尔克孜自治州": ("阿图什市", "阿克陶县", "乌恰县", "阿合奇县"),
    "巴音郭楞蒙古自治州": (
        "库尔勒",
        "焉耆回族自治县",
        "和静县",
        "和硕县",
        "博湖县",
        "轮台县",
        "尉犁县",
        "且末县",
        "若羌县",
    ),
}
SOUTH_FOUR_AREAS: dict[str, tuple[str]] = {
    "阿克苏": (
        "阿克苏市",
        "库车县",
        "沙雅县",
        "新和县",
        "拜城县",
        "温宿县",
        "阿瓦提县",
        "乌什县",
        "柯坪县",
    ),
    "和田": (
        "皮山县",
        "墨玉县",
        "和田市",
        "和田县",
        "洛浦县",
        "策勒县",
        "于田县",
        "民丰县",
        "和安县",
        "和康县",
    ),
    "喀什": (
        "泽普县",
        "岳普湖县",
        "伽师县",
        "叶城县",
        "喀什市",
        "疏勒县",
        "麦盖提县",
        "疏附县",
        "巴楚县",
        "英吉沙县",
        "莎车县",
        "塔什库尔干塔吉克自治县",
    ),
    "克孜勒苏柯尔克孜自治州": ("阿图什市", "阿克陶县", "乌恰县", "阿合奇县"),
}
XJ_UNIVERSITIES: tuple[str] = (
    "阿勒泰",
    "伊犁",
    "克拉玛依",
    "昌吉",
    "石河子",
    "乌鲁木齐",
    "吐鲁番",
    "塔城",
    "哈密",
    "博尔塔拉",
    "阿克苏",
    "和田",
    "喀什",
    "巴音",
    "塔里木",
    "克孜勒苏",
    "兵团",
)